###################################################################

# Created by write_sdc on Thu Jan  5 14:09:32 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions slow -library slow
set_wire_load_model -name tsmc13_wl10 -library slow
set_load -pin_load 0.05 [get_ports {ofmap_o_0[13]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_0[12]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_0[11]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_0[10]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_0[9]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_0[8]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_0[7]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_0[6]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_0[5]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_0[4]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_0[3]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_0[2]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_0[1]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_0[0]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_1[13]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_1[12]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_1[11]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_1[10]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_1[9]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_1[8]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_1[7]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_1[6]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_1[5]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_1[4]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_1[3]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_1[2]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_1[1]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_1[0]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_2[13]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_2[12]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_2[11]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_2[10]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_2[9]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_2[8]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_2[7]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_2[6]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_2[5]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_2[4]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_2[3]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_2[2]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_2[1]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_2[0]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_3[13]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_3[12]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_3[11]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_3[10]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_3[9]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_3[8]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_3[7]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_3[6]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_3[5]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_3[4]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_3[3]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_3[2]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_3[1]}]
set_load -pin_load 0.05 [get_ports {ofmap_o_3[0]}]
set_load -pin_load 0.05 [get_ports valid_o]
set_load -pin_load 0.05 [get_ports {weight_index_o[11]}]
set_load -pin_load 0.05 [get_ports {weight_index_o[10]}]
set_load -pin_load 0.05 [get_ports {weight_index_o[9]}]
set_load -pin_load 0.05 [get_ports {weight_index_o[8]}]
set_load -pin_load 0.05 [get_ports {weight_index_o[7]}]
set_load -pin_load 0.05 [get_ports {weight_index_o[6]}]
set_load -pin_load 0.05 [get_ports {weight_index_o[5]}]
set_load -pin_load 0.05 [get_ports {weight_index_o[4]}]
set_load -pin_load 0.05 [get_ports {weight_index_o[3]}]
set_load -pin_load 0.05 [get_ports {weight_index_o[2]}]
set_load -pin_load 0.05 [get_ports {weight_index_o[1]}]
set_load -pin_load 0.05 [get_ports {weight_index_o[0]}]
set_load -pin_load 0.05 [get_ports {ifmap_index_o[14]}]
set_load -pin_load 0.05 [get_ports {ifmap_index_o[13]}]
set_load -pin_load 0.05 [get_ports {ifmap_index_o[12]}]
set_load -pin_load 0.05 [get_ports {ifmap_index_o[11]}]
set_load -pin_load 0.05 [get_ports {ifmap_index_o[10]}]
set_load -pin_load 0.05 [get_ports {ifmap_index_o[9]}]
set_load -pin_load 0.05 [get_ports {ifmap_index_o[8]}]
set_load -pin_load 0.05 [get_ports {ifmap_index_o[7]}]
set_load -pin_load 0.05 [get_ports {ifmap_index_o[6]}]
set_load -pin_load 0.05 [get_ports {ifmap_index_o[5]}]
set_load -pin_load 0.05 [get_ports {ifmap_index_o[4]}]
set_load -pin_load 0.05 [get_ports {ifmap_index_o[3]}]
set_load -pin_load 0.05 [get_ports {ifmap_index_o[2]}]
set_load -pin_load 0.05 [get_ports {ifmap_index_o[1]}]
set_load -pin_load 0.05 [get_ports {ifmap_index_o[0]}]
set_load -pin_load 0.05 [get_ports {write_addr_o[12]}]
set_load -pin_load 0.05 [get_ports {write_addr_o[11]}]
set_load -pin_load 0.05 [get_ports {write_addr_o[10]}]
set_load -pin_load 0.05 [get_ports {write_addr_o[9]}]
set_load -pin_load 0.05 [get_ports {write_addr_o[8]}]
set_load -pin_load 0.05 [get_ports {write_addr_o[7]}]
set_load -pin_load 0.05 [get_ports {write_addr_o[6]}]
set_load -pin_load 0.05 [get_ports {write_addr_o[5]}]
set_load -pin_load 0.05 [get_ports {write_addr_o[4]}]
set_load -pin_load 0.05 [get_ports {write_addr_o[3]}]
set_load -pin_load 0.05 [get_ports {write_addr_o[2]}]
set_load -pin_load 0.05 [get_ports {write_addr_o[1]}]
set_load -pin_load 0.05 [get_ports {write_addr_o[0]}]
set_load -pin_load 0.05 [get_ports {read_addr_o[12]}]
set_load -pin_load 0.05 [get_ports {read_addr_o[11]}]
set_load -pin_load 0.05 [get_ports {read_addr_o[10]}]
set_load -pin_load 0.05 [get_ports {read_addr_o[9]}]
set_load -pin_load 0.05 [get_ports {read_addr_o[8]}]
set_load -pin_load 0.05 [get_ports {read_addr_o[7]}]
set_load -pin_load 0.05 [get_ports {read_addr_o[6]}]
set_load -pin_load 0.05 [get_ports {read_addr_o[5]}]
set_load -pin_load 0.05 [get_ports {read_addr_o[4]}]
set_load -pin_load 0.05 [get_ports {read_addr_o[3]}]
set_load -pin_load 0.05 [get_ports {read_addr_o[2]}]
set_load -pin_load 0.05 [get_ports {read_addr_o[1]}]
set_load -pin_load 0.05 [get_ports {read_addr_o[0]}]
set_load -pin_load 0.05 [get_ports done_o]
set_load -pin_load 0.05 [get_ports {weight_ifmap_loop[5]}]
set_load -pin_load 0.05 [get_ports {weight_ifmap_loop[4]}]
set_load -pin_load 0.05 [get_ports {weight_ifmap_loop[3]}]
set_load -pin_load 0.05 [get_ports {weight_ifmap_loop[2]}]
set_load -pin_load 0.05 [get_ports {weight_ifmap_loop[1]}]
set_load -pin_load 0.05 [get_ports {weight_ifmap_loop[0]}]
set_load -pin_load 0.05 [get_ports {counter[10]}]
set_load -pin_load 0.05 [get_ports {counter[9]}]
set_load -pin_load 0.05 [get_ports {counter[8]}]
set_load -pin_load 0.05 [get_ports {counter[7]}]
set_load -pin_load 0.05 [get_ports {counter[6]}]
set_load -pin_load 0.05 [get_ports {counter[5]}]
set_load -pin_load 0.05 [get_ports {counter[4]}]
set_load -pin_load 0.05 [get_ports {counter[3]}]
set_load -pin_load 0.05 [get_ports {counter[2]}]
set_load -pin_load 0.05 [get_ports {counter[1]}]
set_load -pin_load 0.05 [get_ports {counter[0]}]
set_max_fanout 20 [get_ports clk_i]
set_max_fanout 20 [get_ports rst_ni]
set_max_fanout 20 [get_ports {PE_ARRAY_COL_i[2]}]
set_max_fanout 20 [get_ports {PE_ARRAY_COL_i[1]}]
set_max_fanout 20 [get_ports {PE_ARRAY_COL_i[0]}]
set_max_fanout 20 [get_ports {PE_COL_ROW_i[4]}]
set_max_fanout 20 [get_ports {PE_COL_ROW_i[3]}]
set_max_fanout 20 [get_ports {PE_COL_ROW_i[2]}]
set_max_fanout 20 [get_ports {PE_COL_ROW_i[1]}]
set_max_fanout 20 [get_ports {PE_COL_ROW_i[0]}]
set_max_fanout 20 [get_ports {WEIGHT_LOOP_i[5]}]
set_max_fanout 20 [get_ports {WEIGHT_LOOP_i[4]}]
set_max_fanout 20 [get_ports {WEIGHT_LOOP_i[3]}]
set_max_fanout 20 [get_ports {WEIGHT_LOOP_i[2]}]
set_max_fanout 20 [get_ports {WEIGHT_LOOP_i[1]}]
set_max_fanout 20 [get_ports {WEIGHT_LOOP_i[0]}]
set_max_fanout 20 [get_ports {WEIGHT_IFMP_LOOP_i[5]}]
set_max_fanout 20 [get_ports {WEIGHT_IFMP_LOOP_i[4]}]
set_max_fanout 20 [get_ports {WEIGHT_IFMP_LOOP_i[3]}]
set_max_fanout 20 [get_ports {WEIGHT_IFMP_LOOP_i[2]}]
set_max_fanout 20 [get_ports {WEIGHT_IFMP_LOOP_i[1]}]
set_max_fanout 20 [get_ports {WEIGHT_IFMP_LOOP_i[0]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_i[10]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_i[9]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_i[8]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_i[7]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_i[6]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_i[5]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_i[4]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_i[3]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_i[2]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_i[1]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_i[0]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_i[11]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_i[10]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_i[9]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_i[8]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_i[7]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_i[6]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_i[5]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_i[4]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_i[3]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_i[2]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_i[1]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_i[0]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_M_i[11]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_M_i[10]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_M_i[9]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_M_i[8]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_M_i[7]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_M_i[6]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_M_i[5]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_M_i[4]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_M_i[3]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_M_i[2]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_M_i[1]}]
set_max_fanout 20 [get_ports {PE_ARRAY_FINISH_SIZE_M_i[0]}]
set_max_fanout 20 [get_ports {THREE_ROW_WEIGHT_SIZE_i[10]}]
set_max_fanout 20 [get_ports {THREE_ROW_WEIGHT_SIZE_i[9]}]
set_max_fanout 20 [get_ports {THREE_ROW_WEIGHT_SIZE_i[8]}]
set_max_fanout 20 [get_ports {THREE_ROW_WEIGHT_SIZE_i[7]}]
set_max_fanout 20 [get_ports {THREE_ROW_WEIGHT_SIZE_i[6]}]
set_max_fanout 20 [get_ports {THREE_ROW_WEIGHT_SIZE_i[5]}]
set_max_fanout 20 [get_ports {THREE_ROW_WEIGHT_SIZE_i[4]}]
set_max_fanout 20 [get_ports {THREE_ROW_WEIGHT_SIZE_i[3]}]
set_max_fanout 20 [get_ports {THREE_ROW_WEIGHT_SIZE_i[2]}]
set_max_fanout 20 [get_ports {THREE_ROW_WEIGHT_SIZE_i[1]}]
set_max_fanout 20 [get_ports {THREE_ROW_WEIGHT_SIZE_i[0]}]
set_max_fanout 20 [get_ports {EIGHT_ROW_IFMAP_SIZE_i[13]}]
set_max_fanout 20 [get_ports {EIGHT_ROW_IFMAP_SIZE_i[12]}]
set_max_fanout 20 [get_ports {EIGHT_ROW_IFMAP_SIZE_i[11]}]
set_max_fanout 20 [get_ports {EIGHT_ROW_IFMAP_SIZE_i[10]}]
set_max_fanout 20 [get_ports {EIGHT_ROW_IFMAP_SIZE_i[9]}]
set_max_fanout 20 [get_ports {EIGHT_ROW_IFMAP_SIZE_i[8]}]
set_max_fanout 20 [get_ports {EIGHT_ROW_IFMAP_SIZE_i[7]}]
set_max_fanout 20 [get_ports {EIGHT_ROW_IFMAP_SIZE_i[6]}]
set_max_fanout 20 [get_ports {EIGHT_ROW_IFMAP_SIZE_i[5]}]
set_max_fanout 20 [get_ports {EIGHT_ROW_IFMAP_SIZE_i[4]}]
set_max_fanout 20 [get_ports {EIGHT_ROW_IFMAP_SIZE_i[3]}]
set_max_fanout 20 [get_ports {EIGHT_ROW_IFMAP_SIZE_i[2]}]
set_max_fanout 20 [get_ports {EIGHT_ROW_IFMAP_SIZE_i[1]}]
set_max_fanout 20 [get_ports {EIGHT_ROW_IFMAP_SIZE_i[0]}]
set_max_fanout 20 [get_ports {w_en[3]}]
set_max_fanout 20 [get_ports {w_en[2]}]
set_max_fanout 20 [get_ports {w_en[1]}]
set_max_fanout 20 [get_ports {w_en[0]}]
set_max_fanout 20 [get_ports {weight0[13]}]
set_max_fanout 20 [get_ports {weight0[12]}]
set_max_fanout 20 [get_ports {weight0[11]}]
set_max_fanout 20 [get_ports {weight0[10]}]
set_max_fanout 20 [get_ports {weight0[9]}]
set_max_fanout 20 [get_ports {weight0[8]}]
set_max_fanout 20 [get_ports {weight0[7]}]
set_max_fanout 20 [get_ports {weight0[6]}]
set_max_fanout 20 [get_ports {weight0[5]}]
set_max_fanout 20 [get_ports {weight0[4]}]
set_max_fanout 20 [get_ports {weight0[3]}]
set_max_fanout 20 [get_ports {weight0[2]}]
set_max_fanout 20 [get_ports {weight0[1]}]
set_max_fanout 20 [get_ports {weight0[0]}]
set_max_fanout 20 [get_ports {weight1[13]}]
set_max_fanout 20 [get_ports {weight1[12]}]
set_max_fanout 20 [get_ports {weight1[11]}]
set_max_fanout 20 [get_ports {weight1[10]}]
set_max_fanout 20 [get_ports {weight1[9]}]
set_max_fanout 20 [get_ports {weight1[8]}]
set_max_fanout 20 [get_ports {weight1[7]}]
set_max_fanout 20 [get_ports {weight1[6]}]
set_max_fanout 20 [get_ports {weight1[5]}]
set_max_fanout 20 [get_ports {weight1[4]}]
set_max_fanout 20 [get_ports {weight1[3]}]
set_max_fanout 20 [get_ports {weight1[2]}]
set_max_fanout 20 [get_ports {weight1[1]}]
set_max_fanout 20 [get_ports {weight1[0]}]
set_max_fanout 20 [get_ports {weight2[13]}]
set_max_fanout 20 [get_ports {weight2[12]}]
set_max_fanout 20 [get_ports {weight2[11]}]
set_max_fanout 20 [get_ports {weight2[10]}]
set_max_fanout 20 [get_ports {weight2[9]}]
set_max_fanout 20 [get_ports {weight2[8]}]
set_max_fanout 20 [get_ports {weight2[7]}]
set_max_fanout 20 [get_ports {weight2[6]}]
set_max_fanout 20 [get_ports {weight2[5]}]
set_max_fanout 20 [get_ports {weight2[4]}]
set_max_fanout 20 [get_ports {weight2[3]}]
set_max_fanout 20 [get_ports {weight2[2]}]
set_max_fanout 20 [get_ports {weight2[1]}]
set_max_fanout 20 [get_ports {weight2[0]}]
set_max_fanout 20 [get_ports {weight3[13]}]
set_max_fanout 20 [get_ports {weight3[12]}]
set_max_fanout 20 [get_ports {weight3[11]}]
set_max_fanout 20 [get_ports {weight3[10]}]
set_max_fanout 20 [get_ports {weight3[9]}]
set_max_fanout 20 [get_ports {weight3[8]}]
set_max_fanout 20 [get_ports {weight3[7]}]
set_max_fanout 20 [get_ports {weight3[6]}]
set_max_fanout 20 [get_ports {weight3[5]}]
set_max_fanout 20 [get_ports {weight3[4]}]
set_max_fanout 20 [get_ports {weight3[3]}]
set_max_fanout 20 [get_ports {weight3[2]}]
set_max_fanout 20 [get_ports {weight3[1]}]
set_max_fanout 20 [get_ports {weight3[0]}]
set_max_fanout 20 [get_ports {weight4[13]}]
set_max_fanout 20 [get_ports {weight4[12]}]
set_max_fanout 20 [get_ports {weight4[11]}]
set_max_fanout 20 [get_ports {weight4[10]}]
set_max_fanout 20 [get_ports {weight4[9]}]
set_max_fanout 20 [get_ports {weight4[8]}]
set_max_fanout 20 [get_ports {weight4[7]}]
set_max_fanout 20 [get_ports {weight4[6]}]
set_max_fanout 20 [get_ports {weight4[5]}]
set_max_fanout 20 [get_ports {weight4[4]}]
set_max_fanout 20 [get_ports {weight4[3]}]
set_max_fanout 20 [get_ports {weight4[2]}]
set_max_fanout 20 [get_ports {weight4[1]}]
set_max_fanout 20 [get_ports {weight4[0]}]
set_max_fanout 20 [get_ports {weight5[13]}]
set_max_fanout 20 [get_ports {weight5[12]}]
set_max_fanout 20 [get_ports {weight5[11]}]
set_max_fanout 20 [get_ports {weight5[10]}]
set_max_fanout 20 [get_ports {weight5[9]}]
set_max_fanout 20 [get_ports {weight5[8]}]
set_max_fanout 20 [get_ports {weight5[7]}]
set_max_fanout 20 [get_ports {weight5[6]}]
set_max_fanout 20 [get_ports {weight5[5]}]
set_max_fanout 20 [get_ports {weight5[4]}]
set_max_fanout 20 [get_ports {weight5[3]}]
set_max_fanout 20 [get_ports {weight5[2]}]
set_max_fanout 20 [get_ports {weight5[1]}]
set_max_fanout 20 [get_ports {weight5[0]}]
set_max_fanout 20 [get_ports {weight6[13]}]
set_max_fanout 20 [get_ports {weight6[12]}]
set_max_fanout 20 [get_ports {weight6[11]}]
set_max_fanout 20 [get_ports {weight6[10]}]
set_max_fanout 20 [get_ports {weight6[9]}]
set_max_fanout 20 [get_ports {weight6[8]}]
set_max_fanout 20 [get_ports {weight6[7]}]
set_max_fanout 20 [get_ports {weight6[6]}]
set_max_fanout 20 [get_ports {weight6[5]}]
set_max_fanout 20 [get_ports {weight6[4]}]
set_max_fanout 20 [get_ports {weight6[3]}]
set_max_fanout 20 [get_ports {weight6[2]}]
set_max_fanout 20 [get_ports {weight6[1]}]
set_max_fanout 20 [get_ports {weight6[0]}]
set_max_fanout 20 [get_ports {weight7[13]}]
set_max_fanout 20 [get_ports {weight7[12]}]
set_max_fanout 20 [get_ports {weight7[11]}]
set_max_fanout 20 [get_ports {weight7[10]}]
set_max_fanout 20 [get_ports {weight7[9]}]
set_max_fanout 20 [get_ports {weight7[8]}]
set_max_fanout 20 [get_ports {weight7[7]}]
set_max_fanout 20 [get_ports {weight7[6]}]
set_max_fanout 20 [get_ports {weight7[5]}]
set_max_fanout 20 [get_ports {weight7[4]}]
set_max_fanout 20 [get_ports {weight7[3]}]
set_max_fanout 20 [get_ports {weight7[2]}]
set_max_fanout 20 [get_ports {weight7[1]}]
set_max_fanout 20 [get_ports {weight7[0]}]
set_max_fanout 20 [get_ports {weight8[13]}]
set_max_fanout 20 [get_ports {weight8[12]}]
set_max_fanout 20 [get_ports {weight8[11]}]
set_max_fanout 20 [get_ports {weight8[10]}]
set_max_fanout 20 [get_ports {weight8[9]}]
set_max_fanout 20 [get_ports {weight8[8]}]
set_max_fanout 20 [get_ports {weight8[7]}]
set_max_fanout 20 [get_ports {weight8[6]}]
set_max_fanout 20 [get_ports {weight8[5]}]
set_max_fanout 20 [get_ports {weight8[4]}]
set_max_fanout 20 [get_ports {weight8[3]}]
set_max_fanout 20 [get_ports {weight8[2]}]
set_max_fanout 20 [get_ports {weight8[1]}]
set_max_fanout 20 [get_ports {weight8[0]}]
set_max_fanout 20 [get_ports {weight9[13]}]
set_max_fanout 20 [get_ports {weight9[12]}]
set_max_fanout 20 [get_ports {weight9[11]}]
set_max_fanout 20 [get_ports {weight9[10]}]
set_max_fanout 20 [get_ports {weight9[9]}]
set_max_fanout 20 [get_ports {weight9[8]}]
set_max_fanout 20 [get_ports {weight9[7]}]
set_max_fanout 20 [get_ports {weight9[6]}]
set_max_fanout 20 [get_ports {weight9[5]}]
set_max_fanout 20 [get_ports {weight9[4]}]
set_max_fanout 20 [get_ports {weight9[3]}]
set_max_fanout 20 [get_ports {weight9[2]}]
set_max_fanout 20 [get_ports {weight9[1]}]
set_max_fanout 20 [get_ports {weight9[0]}]
set_max_fanout 20 [get_ports {weight10[13]}]
set_max_fanout 20 [get_ports {weight10[12]}]
set_max_fanout 20 [get_ports {weight10[11]}]
set_max_fanout 20 [get_ports {weight10[10]}]
set_max_fanout 20 [get_ports {weight10[9]}]
set_max_fanout 20 [get_ports {weight10[8]}]
set_max_fanout 20 [get_ports {weight10[7]}]
set_max_fanout 20 [get_ports {weight10[6]}]
set_max_fanout 20 [get_ports {weight10[5]}]
set_max_fanout 20 [get_ports {weight10[4]}]
set_max_fanout 20 [get_ports {weight10[3]}]
set_max_fanout 20 [get_ports {weight10[2]}]
set_max_fanout 20 [get_ports {weight10[1]}]
set_max_fanout 20 [get_ports {weight10[0]}]
set_max_fanout 20 [get_ports {weight11[13]}]
set_max_fanout 20 [get_ports {weight11[12]}]
set_max_fanout 20 [get_ports {weight11[11]}]
set_max_fanout 20 [get_ports {weight11[10]}]
set_max_fanout 20 [get_ports {weight11[9]}]
set_max_fanout 20 [get_ports {weight11[8]}]
set_max_fanout 20 [get_ports {weight11[7]}]
set_max_fanout 20 [get_ports {weight11[6]}]
set_max_fanout 20 [get_ports {weight11[5]}]
set_max_fanout 20 [get_ports {weight11[4]}]
set_max_fanout 20 [get_ports {weight11[3]}]
set_max_fanout 20 [get_ports {weight11[2]}]
set_max_fanout 20 [get_ports {weight11[1]}]
set_max_fanout 20 [get_ports {weight11[0]}]
set_max_fanout 20 [get_ports {weight12[13]}]
set_max_fanout 20 [get_ports {weight12[12]}]
set_max_fanout 20 [get_ports {weight12[11]}]
set_max_fanout 20 [get_ports {weight12[10]}]
set_max_fanout 20 [get_ports {weight12[9]}]
set_max_fanout 20 [get_ports {weight12[8]}]
set_max_fanout 20 [get_ports {weight12[7]}]
set_max_fanout 20 [get_ports {weight12[6]}]
set_max_fanout 20 [get_ports {weight12[5]}]
set_max_fanout 20 [get_ports {weight12[4]}]
set_max_fanout 20 [get_ports {weight12[3]}]
set_max_fanout 20 [get_ports {weight12[2]}]
set_max_fanout 20 [get_ports {weight12[1]}]
set_max_fanout 20 [get_ports {weight12[0]}]
set_max_fanout 20 [get_ports {weight13[13]}]
set_max_fanout 20 [get_ports {weight13[12]}]
set_max_fanout 20 [get_ports {weight13[11]}]
set_max_fanout 20 [get_ports {weight13[10]}]
set_max_fanout 20 [get_ports {weight13[9]}]
set_max_fanout 20 [get_ports {weight13[8]}]
set_max_fanout 20 [get_ports {weight13[7]}]
set_max_fanout 20 [get_ports {weight13[6]}]
set_max_fanout 20 [get_ports {weight13[5]}]
set_max_fanout 20 [get_ports {weight13[4]}]
set_max_fanout 20 [get_ports {weight13[3]}]
set_max_fanout 20 [get_ports {weight13[2]}]
set_max_fanout 20 [get_ports {weight13[1]}]
set_max_fanout 20 [get_ports {weight13[0]}]
set_max_fanout 20 [get_ports {weight14[13]}]
set_max_fanout 20 [get_ports {weight14[12]}]
set_max_fanout 20 [get_ports {weight14[11]}]
set_max_fanout 20 [get_ports {weight14[10]}]
set_max_fanout 20 [get_ports {weight14[9]}]
set_max_fanout 20 [get_ports {weight14[8]}]
set_max_fanout 20 [get_ports {weight14[7]}]
set_max_fanout 20 [get_ports {weight14[6]}]
set_max_fanout 20 [get_ports {weight14[5]}]
set_max_fanout 20 [get_ports {weight14[4]}]
set_max_fanout 20 [get_ports {weight14[3]}]
set_max_fanout 20 [get_ports {weight14[2]}]
set_max_fanout 20 [get_ports {weight14[1]}]
set_max_fanout 20 [get_ports {weight14[0]}]
set_max_fanout 20 [get_ports {weight15[13]}]
set_max_fanout 20 [get_ports {weight15[12]}]
set_max_fanout 20 [get_ports {weight15[11]}]
set_max_fanout 20 [get_ports {weight15[10]}]
set_max_fanout 20 [get_ports {weight15[9]}]
set_max_fanout 20 [get_ports {weight15[8]}]
set_max_fanout 20 [get_ports {weight15[7]}]
set_max_fanout 20 [get_ports {weight15[6]}]
set_max_fanout 20 [get_ports {weight15[5]}]
set_max_fanout 20 [get_ports {weight15[4]}]
set_max_fanout 20 [get_ports {weight15[3]}]
set_max_fanout 20 [get_ports {weight15[2]}]
set_max_fanout 20 [get_ports {weight15[1]}]
set_max_fanout 20 [get_ports {weight15[0]}]
set_max_fanout 20 [get_ports {ifmap0[13]}]
set_max_fanout 20 [get_ports {ifmap0[12]}]
set_max_fanout 20 [get_ports {ifmap0[11]}]
set_max_fanout 20 [get_ports {ifmap0[10]}]
set_max_fanout 20 [get_ports {ifmap0[9]}]
set_max_fanout 20 [get_ports {ifmap0[8]}]
set_max_fanout 20 [get_ports {ifmap0[7]}]
set_max_fanout 20 [get_ports {ifmap0[6]}]
set_max_fanout 20 [get_ports {ifmap0[5]}]
set_max_fanout 20 [get_ports {ifmap0[4]}]
set_max_fanout 20 [get_ports {ifmap0[3]}]
set_max_fanout 20 [get_ports {ifmap0[2]}]
set_max_fanout 20 [get_ports {ifmap0[1]}]
set_max_fanout 20 [get_ports {ifmap0[0]}]
set_max_fanout 20 [get_ports {ifmap1[13]}]
set_max_fanout 20 [get_ports {ifmap1[12]}]
set_max_fanout 20 [get_ports {ifmap1[11]}]
set_max_fanout 20 [get_ports {ifmap1[10]}]
set_max_fanout 20 [get_ports {ifmap1[9]}]
set_max_fanout 20 [get_ports {ifmap1[8]}]
set_max_fanout 20 [get_ports {ifmap1[7]}]
set_max_fanout 20 [get_ports {ifmap1[6]}]
set_max_fanout 20 [get_ports {ifmap1[5]}]
set_max_fanout 20 [get_ports {ifmap1[4]}]
set_max_fanout 20 [get_ports {ifmap1[3]}]
set_max_fanout 20 [get_ports {ifmap1[2]}]
set_max_fanout 20 [get_ports {ifmap1[1]}]
set_max_fanout 20 [get_ports {ifmap1[0]}]
set_max_fanout 20 [get_ports {ifmap2[13]}]
set_max_fanout 20 [get_ports {ifmap2[12]}]
set_max_fanout 20 [get_ports {ifmap2[11]}]
set_max_fanout 20 [get_ports {ifmap2[10]}]
set_max_fanout 20 [get_ports {ifmap2[9]}]
set_max_fanout 20 [get_ports {ifmap2[8]}]
set_max_fanout 20 [get_ports {ifmap2[7]}]
set_max_fanout 20 [get_ports {ifmap2[6]}]
set_max_fanout 20 [get_ports {ifmap2[5]}]
set_max_fanout 20 [get_ports {ifmap2[4]}]
set_max_fanout 20 [get_ports {ifmap2[3]}]
set_max_fanout 20 [get_ports {ifmap2[2]}]
set_max_fanout 20 [get_ports {ifmap2[1]}]
set_max_fanout 20 [get_ports {ifmap2[0]}]
set_max_fanout 20 [get_ports {ifmap3[13]}]
set_max_fanout 20 [get_ports {ifmap3[12]}]
set_max_fanout 20 [get_ports {ifmap3[11]}]
set_max_fanout 20 [get_ports {ifmap3[10]}]
set_max_fanout 20 [get_ports {ifmap3[9]}]
set_max_fanout 20 [get_ports {ifmap3[8]}]
set_max_fanout 20 [get_ports {ifmap3[7]}]
set_max_fanout 20 [get_ports {ifmap3[6]}]
set_max_fanout 20 [get_ports {ifmap3[5]}]
set_max_fanout 20 [get_ports {ifmap3[4]}]
set_max_fanout 20 [get_ports {ifmap3[3]}]
set_max_fanout 20 [get_ports {ifmap3[2]}]
set_max_fanout 20 [get_ports {ifmap3[1]}]
set_max_fanout 20 [get_ports {ifmap3[0]}]
set_max_fanout 20 [get_ports {ifmap4[13]}]
set_max_fanout 20 [get_ports {ifmap4[12]}]
set_max_fanout 20 [get_ports {ifmap4[11]}]
set_max_fanout 20 [get_ports {ifmap4[10]}]
set_max_fanout 20 [get_ports {ifmap4[9]}]
set_max_fanout 20 [get_ports {ifmap4[8]}]
set_max_fanout 20 [get_ports {ifmap4[7]}]
set_max_fanout 20 [get_ports {ifmap4[6]}]
set_max_fanout 20 [get_ports {ifmap4[5]}]
set_max_fanout 20 [get_ports {ifmap4[4]}]
set_max_fanout 20 [get_ports {ifmap4[3]}]
set_max_fanout 20 [get_ports {ifmap4[2]}]
set_max_fanout 20 [get_ports {ifmap4[1]}]
set_max_fanout 20 [get_ports {ifmap4[0]}]
set_max_fanout 20 [get_ports {ifmap5[13]}]
set_max_fanout 20 [get_ports {ifmap5[12]}]
set_max_fanout 20 [get_ports {ifmap5[11]}]
set_max_fanout 20 [get_ports {ifmap5[10]}]
set_max_fanout 20 [get_ports {ifmap5[9]}]
set_max_fanout 20 [get_ports {ifmap5[8]}]
set_max_fanout 20 [get_ports {ifmap5[7]}]
set_max_fanout 20 [get_ports {ifmap5[6]}]
set_max_fanout 20 [get_ports {ifmap5[5]}]
set_max_fanout 20 [get_ports {ifmap5[4]}]
set_max_fanout 20 [get_ports {ifmap5[3]}]
set_max_fanout 20 [get_ports {ifmap5[2]}]
set_max_fanout 20 [get_ports {ifmap5[1]}]
set_max_fanout 20 [get_ports {ifmap5[0]}]
set_max_fanout 20 [get_ports {ifmap6[13]}]
set_max_fanout 20 [get_ports {ifmap6[12]}]
set_max_fanout 20 [get_ports {ifmap6[11]}]
set_max_fanout 20 [get_ports {ifmap6[10]}]
set_max_fanout 20 [get_ports {ifmap6[9]}]
set_max_fanout 20 [get_ports {ifmap6[8]}]
set_max_fanout 20 [get_ports {ifmap6[7]}]
set_max_fanout 20 [get_ports {ifmap6[6]}]
set_max_fanout 20 [get_ports {ifmap6[5]}]
set_max_fanout 20 [get_ports {ifmap6[4]}]
set_max_fanout 20 [get_ports {ifmap6[3]}]
set_max_fanout 20 [get_ports {ifmap6[2]}]
set_max_fanout 20 [get_ports {ifmap6[1]}]
set_max_fanout 20 [get_ports {ifmap6[0]}]
set_max_fanout 20 [get_ports {ifmap7[13]}]
set_max_fanout 20 [get_ports {ifmap7[12]}]
set_max_fanout 20 [get_ports {ifmap7[11]}]
set_max_fanout 20 [get_ports {ifmap7[10]}]
set_max_fanout 20 [get_ports {ifmap7[9]}]
set_max_fanout 20 [get_ports {ifmap7[8]}]
set_max_fanout 20 [get_ports {ifmap7[7]}]
set_max_fanout 20 [get_ports {ifmap7[6]}]
set_max_fanout 20 [get_ports {ifmap7[5]}]
set_max_fanout 20 [get_ports {ifmap7[4]}]
set_max_fanout 20 [get_ports {ifmap7[3]}]
set_max_fanout 20 [get_ports {ifmap7[2]}]
set_max_fanout 20 [get_ports {ifmap7[1]}]
set_max_fanout 20 [get_ports {ifmap7[0]}]
set_max_fanout 20 [get_ports {ifmap8[13]}]
set_max_fanout 20 [get_ports {ifmap8[12]}]
set_max_fanout 20 [get_ports {ifmap8[11]}]
set_max_fanout 20 [get_ports {ifmap8[10]}]
set_max_fanout 20 [get_ports {ifmap8[9]}]
set_max_fanout 20 [get_ports {ifmap8[8]}]
set_max_fanout 20 [get_ports {ifmap8[7]}]
set_max_fanout 20 [get_ports {ifmap8[6]}]
set_max_fanout 20 [get_ports {ifmap8[5]}]
set_max_fanout 20 [get_ports {ifmap8[4]}]
set_max_fanout 20 [get_ports {ifmap8[3]}]
set_max_fanout 20 [get_ports {ifmap8[2]}]
set_max_fanout 20 [get_ports {ifmap8[1]}]
set_max_fanout 20 [get_ports {ifmap8[0]}]
set_max_fanout 20 [get_ports {ifmap9[13]}]
set_max_fanout 20 [get_ports {ifmap9[12]}]
set_max_fanout 20 [get_ports {ifmap9[11]}]
set_max_fanout 20 [get_ports {ifmap9[10]}]
set_max_fanout 20 [get_ports {ifmap9[9]}]
set_max_fanout 20 [get_ports {ifmap9[8]}]
set_max_fanout 20 [get_ports {ifmap9[7]}]
set_max_fanout 20 [get_ports {ifmap9[6]}]
set_max_fanout 20 [get_ports {ifmap9[5]}]
set_max_fanout 20 [get_ports {ifmap9[4]}]
set_max_fanout 20 [get_ports {ifmap9[3]}]
set_max_fanout 20 [get_ports {ifmap9[2]}]
set_max_fanout 20 [get_ports {ifmap9[1]}]
set_max_fanout 20 [get_ports {ifmap9[0]}]
set_max_fanout 20 [get_ports {ifmap10[13]}]
set_max_fanout 20 [get_ports {ifmap10[12]}]
set_max_fanout 20 [get_ports {ifmap10[11]}]
set_max_fanout 20 [get_ports {ifmap10[10]}]
set_max_fanout 20 [get_ports {ifmap10[9]}]
set_max_fanout 20 [get_ports {ifmap10[8]}]
set_max_fanout 20 [get_ports {ifmap10[7]}]
set_max_fanout 20 [get_ports {ifmap10[6]}]
set_max_fanout 20 [get_ports {ifmap10[5]}]
set_max_fanout 20 [get_ports {ifmap10[4]}]
set_max_fanout 20 [get_ports {ifmap10[3]}]
set_max_fanout 20 [get_ports {ifmap10[2]}]
set_max_fanout 20 [get_ports {ifmap10[1]}]
set_max_fanout 20 [get_ports {ifmap10[0]}]
set_max_fanout 20 [get_ports {ifmap11[13]}]
set_max_fanout 20 [get_ports {ifmap11[12]}]
set_max_fanout 20 [get_ports {ifmap11[11]}]
set_max_fanout 20 [get_ports {ifmap11[10]}]
set_max_fanout 20 [get_ports {ifmap11[9]}]
set_max_fanout 20 [get_ports {ifmap11[8]}]
set_max_fanout 20 [get_ports {ifmap11[7]}]
set_max_fanout 20 [get_ports {ifmap11[6]}]
set_max_fanout 20 [get_ports {ifmap11[5]}]
set_max_fanout 20 [get_ports {ifmap11[4]}]
set_max_fanout 20 [get_ports {ifmap11[3]}]
set_max_fanout 20 [get_ports {ifmap11[2]}]
set_max_fanout 20 [get_ports {ifmap11[1]}]
set_max_fanout 20 [get_ports {ifmap11[0]}]
set_max_fanout 20 [get_ports {ifmap12[13]}]
set_max_fanout 20 [get_ports {ifmap12[12]}]
set_max_fanout 20 [get_ports {ifmap12[11]}]
set_max_fanout 20 [get_ports {ifmap12[10]}]
set_max_fanout 20 [get_ports {ifmap12[9]}]
set_max_fanout 20 [get_ports {ifmap12[8]}]
set_max_fanout 20 [get_ports {ifmap12[7]}]
set_max_fanout 20 [get_ports {ifmap12[6]}]
set_max_fanout 20 [get_ports {ifmap12[5]}]
set_max_fanout 20 [get_ports {ifmap12[4]}]
set_max_fanout 20 [get_ports {ifmap12[3]}]
set_max_fanout 20 [get_ports {ifmap12[2]}]
set_max_fanout 20 [get_ports {ifmap12[1]}]
set_max_fanout 20 [get_ports {ifmap12[0]}]
set_max_fanout 20 [get_ports {ifmap13[13]}]
set_max_fanout 20 [get_ports {ifmap13[12]}]
set_max_fanout 20 [get_ports {ifmap13[11]}]
set_max_fanout 20 [get_ports {ifmap13[10]}]
set_max_fanout 20 [get_ports {ifmap13[9]}]
set_max_fanout 20 [get_ports {ifmap13[8]}]
set_max_fanout 20 [get_ports {ifmap13[7]}]
set_max_fanout 20 [get_ports {ifmap13[6]}]
set_max_fanout 20 [get_ports {ifmap13[5]}]
set_max_fanout 20 [get_ports {ifmap13[4]}]
set_max_fanout 20 [get_ports {ifmap13[3]}]
set_max_fanout 20 [get_ports {ifmap13[2]}]
set_max_fanout 20 [get_ports {ifmap13[1]}]
set_max_fanout 20 [get_ports {ifmap13[0]}]
set_max_fanout 20 [get_ports {ifmap14[13]}]
set_max_fanout 20 [get_ports {ifmap14[12]}]
set_max_fanout 20 [get_ports {ifmap14[11]}]
set_max_fanout 20 [get_ports {ifmap14[10]}]
set_max_fanout 20 [get_ports {ifmap14[9]}]
set_max_fanout 20 [get_ports {ifmap14[8]}]
set_max_fanout 20 [get_ports {ifmap14[7]}]
set_max_fanout 20 [get_ports {ifmap14[6]}]
set_max_fanout 20 [get_ports {ifmap14[5]}]
set_max_fanout 20 [get_ports {ifmap14[4]}]
set_max_fanout 20 [get_ports {ifmap14[3]}]
set_max_fanout 20 [get_ports {ifmap14[2]}]
set_max_fanout 20 [get_ports {ifmap14[1]}]
set_max_fanout 20 [get_ports {ifmap14[0]}]
set_max_fanout 20 [get_ports {ifmap15[13]}]
set_max_fanout 20 [get_ports {ifmap15[12]}]
set_max_fanout 20 [get_ports {ifmap15[11]}]
set_max_fanout 20 [get_ports {ifmap15[10]}]
set_max_fanout 20 [get_ports {ifmap15[9]}]
set_max_fanout 20 [get_ports {ifmap15[8]}]
set_max_fanout 20 [get_ports {ifmap15[7]}]
set_max_fanout 20 [get_ports {ifmap15[6]}]
set_max_fanout 20 [get_ports {ifmap15[5]}]
set_max_fanout 20 [get_ports {ifmap15[4]}]
set_max_fanout 20 [get_ports {ifmap15[3]}]
set_max_fanout 20 [get_ports {ifmap15[2]}]
set_max_fanout 20 [get_ports {ifmap15[1]}]
set_max_fanout 20 [get_ports {ifmap15[0]}]
set_max_fanout 20 [get_ports {add_i1[13]}]
set_max_fanout 20 [get_ports {add_i1[12]}]
set_max_fanout 20 [get_ports {add_i1[11]}]
set_max_fanout 20 [get_ports {add_i1[10]}]
set_max_fanout 20 [get_ports {add_i1[9]}]
set_max_fanout 20 [get_ports {add_i1[8]}]
set_max_fanout 20 [get_ports {add_i1[7]}]
set_max_fanout 20 [get_ports {add_i1[6]}]
set_max_fanout 20 [get_ports {add_i1[5]}]
set_max_fanout 20 [get_ports {add_i1[4]}]
set_max_fanout 20 [get_ports {add_i1[3]}]
set_max_fanout 20 [get_ports {add_i1[2]}]
set_max_fanout 20 [get_ports {add_i1[1]}]
set_max_fanout 20 [get_ports {add_i1[0]}]
set_max_fanout 20 [get_ports {add_i2[13]}]
set_max_fanout 20 [get_ports {add_i2[12]}]
set_max_fanout 20 [get_ports {add_i2[11]}]
set_max_fanout 20 [get_ports {add_i2[10]}]
set_max_fanout 20 [get_ports {add_i2[9]}]
set_max_fanout 20 [get_ports {add_i2[8]}]
set_max_fanout 20 [get_ports {add_i2[7]}]
set_max_fanout 20 [get_ports {add_i2[6]}]
set_max_fanout 20 [get_ports {add_i2[5]}]
set_max_fanout 20 [get_ports {add_i2[4]}]
set_max_fanout 20 [get_ports {add_i2[3]}]
set_max_fanout 20 [get_ports {add_i2[2]}]
set_max_fanout 20 [get_ports {add_i2[1]}]
set_max_fanout 20 [get_ports {add_i2[0]}]
set_max_fanout 20 [get_ports {add_i3[13]}]
set_max_fanout 20 [get_ports {add_i3[12]}]
set_max_fanout 20 [get_ports {add_i3[11]}]
set_max_fanout 20 [get_ports {add_i3[10]}]
set_max_fanout 20 [get_ports {add_i3[9]}]
set_max_fanout 20 [get_ports {add_i3[8]}]
set_max_fanout 20 [get_ports {add_i3[7]}]
set_max_fanout 20 [get_ports {add_i3[6]}]
set_max_fanout 20 [get_ports {add_i3[5]}]
set_max_fanout 20 [get_ports {add_i3[4]}]
set_max_fanout 20 [get_ports {add_i3[3]}]
set_max_fanout 20 [get_ports {add_i3[2]}]
set_max_fanout 20 [get_ports {add_i3[1]}]
set_max_fanout 20 [get_ports {add_i3[0]}]
set_max_fanout 20 [get_ports {add_i4[13]}]
set_max_fanout 20 [get_ports {add_i4[12]}]
set_max_fanout 20 [get_ports {add_i4[11]}]
set_max_fanout 20 [get_ports {add_i4[10]}]
set_max_fanout 20 [get_ports {add_i4[9]}]
set_max_fanout 20 [get_ports {add_i4[8]}]
set_max_fanout 20 [get_ports {add_i4[7]}]
set_max_fanout 20 [get_ports {add_i4[6]}]
set_max_fanout 20 [get_ports {add_i4[5]}]
set_max_fanout 20 [get_ports {add_i4[4]}]
set_max_fanout 20 [get_ports {add_i4[3]}]
set_max_fanout 20 [get_ports {add_i4[2]}]
set_max_fanout 20 [get_ports {add_i4[1]}]
set_max_fanout 20 [get_ports {add_i4[0]}]
create_clock [get_ports clk_i]  -period 20  -waveform {0 10}
set_clock_latency 0.5  [get_clocks clk_i]
set_clock_uncertainty 0.1  [get_clocks clk_i]
set_input_delay -clock clk_i  10  [get_ports clk_i]
set_input_delay -clock clk_i  10  [get_ports rst_ni]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_COL_i[2]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_COL_i[1]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_COL_i[0]}]
set_input_delay -clock clk_i  10  [get_ports {PE_COL_ROW_i[4]}]
set_input_delay -clock clk_i  10  [get_ports {PE_COL_ROW_i[3]}]
set_input_delay -clock clk_i  10  [get_ports {PE_COL_ROW_i[2]}]
set_input_delay -clock clk_i  10  [get_ports {PE_COL_ROW_i[1]}]
set_input_delay -clock clk_i  10  [get_ports {PE_COL_ROW_i[0]}]
set_input_delay -clock clk_i  10  [get_ports {WEIGHT_LOOP_i[5]}]
set_input_delay -clock clk_i  10  [get_ports {WEIGHT_LOOP_i[4]}]
set_input_delay -clock clk_i  10  [get_ports {WEIGHT_LOOP_i[3]}]
set_input_delay -clock clk_i  10  [get_ports {WEIGHT_LOOP_i[2]}]
set_input_delay -clock clk_i  10  [get_ports {WEIGHT_LOOP_i[1]}]
set_input_delay -clock clk_i  10  [get_ports {WEIGHT_LOOP_i[0]}]
set_input_delay -clock clk_i  10  [get_ports {WEIGHT_IFMP_LOOP_i[5]}]
set_input_delay -clock clk_i  10  [get_ports {WEIGHT_IFMP_LOOP_i[4]}]
set_input_delay -clock clk_i  10  [get_ports {WEIGHT_IFMP_LOOP_i[3]}]
set_input_delay -clock clk_i  10  [get_ports {WEIGHT_IFMP_LOOP_i[2]}]
set_input_delay -clock clk_i  10  [get_ports {WEIGHT_IFMP_LOOP_i[1]}]
set_input_delay -clock clk_i  10  [get_ports {WEIGHT_IFMP_LOOP_i[0]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_i[10]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_i[9]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_i[8]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_i[7]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_i[6]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_i[5]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_i[4]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_i[3]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_i[2]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_i[1]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_i[0]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_i[11]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_i[10]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_i[9]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_i[8]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_i[7]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_i[6]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_i[5]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_i[4]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_i[3]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_i[2]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_i[1]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_i[0]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_M_i[11]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_M_i[10]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_M_i[9]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_M_i[8]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_M_i[7]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_M_i[6]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_M_i[5]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_M_i[4]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_M_i[3]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_M_i[2]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_M_i[1]}]
set_input_delay -clock clk_i  10  [get_ports {PE_ARRAY_FINISH_SIZE_M_i[0]}]
set_input_delay -clock clk_i  10  [get_ports {THREE_ROW_WEIGHT_SIZE_i[10]}]
set_input_delay -clock clk_i  10  [get_ports {THREE_ROW_WEIGHT_SIZE_i[9]}]
set_input_delay -clock clk_i  10  [get_ports {THREE_ROW_WEIGHT_SIZE_i[8]}]
set_input_delay -clock clk_i  10  [get_ports {THREE_ROW_WEIGHT_SIZE_i[7]}]
set_input_delay -clock clk_i  10  [get_ports {THREE_ROW_WEIGHT_SIZE_i[6]}]
set_input_delay -clock clk_i  10  [get_ports {THREE_ROW_WEIGHT_SIZE_i[5]}]
set_input_delay -clock clk_i  10  [get_ports {THREE_ROW_WEIGHT_SIZE_i[4]}]
set_input_delay -clock clk_i  10  [get_ports {THREE_ROW_WEIGHT_SIZE_i[3]}]
set_input_delay -clock clk_i  10  [get_ports {THREE_ROW_WEIGHT_SIZE_i[2]}]
set_input_delay -clock clk_i  10  [get_ports {THREE_ROW_WEIGHT_SIZE_i[1]}]
set_input_delay -clock clk_i  10  [get_ports {THREE_ROW_WEIGHT_SIZE_i[0]}]
set_input_delay -clock clk_i  10  [get_ports {EIGHT_ROW_IFMAP_SIZE_i[13]}]
set_input_delay -clock clk_i  10  [get_ports {EIGHT_ROW_IFMAP_SIZE_i[12]}]
set_input_delay -clock clk_i  10  [get_ports {EIGHT_ROW_IFMAP_SIZE_i[11]}]
set_input_delay -clock clk_i  10  [get_ports {EIGHT_ROW_IFMAP_SIZE_i[10]}]
set_input_delay -clock clk_i  10  [get_ports {EIGHT_ROW_IFMAP_SIZE_i[9]}]
set_input_delay -clock clk_i  10  [get_ports {EIGHT_ROW_IFMAP_SIZE_i[8]}]
set_input_delay -clock clk_i  10  [get_ports {EIGHT_ROW_IFMAP_SIZE_i[7]}]
set_input_delay -clock clk_i  10  [get_ports {EIGHT_ROW_IFMAP_SIZE_i[6]}]
set_input_delay -clock clk_i  10  [get_ports {EIGHT_ROW_IFMAP_SIZE_i[5]}]
set_input_delay -clock clk_i  10  [get_ports {EIGHT_ROW_IFMAP_SIZE_i[4]}]
set_input_delay -clock clk_i  10  [get_ports {EIGHT_ROW_IFMAP_SIZE_i[3]}]
set_input_delay -clock clk_i  10  [get_ports {EIGHT_ROW_IFMAP_SIZE_i[2]}]
set_input_delay -clock clk_i  10  [get_ports {EIGHT_ROW_IFMAP_SIZE_i[1]}]
set_input_delay -clock clk_i  10  [get_ports {EIGHT_ROW_IFMAP_SIZE_i[0]}]
set_input_delay -clock clk_i  10  [get_ports {w_en[3]}]
set_input_delay -clock clk_i  10  [get_ports {w_en[2]}]
set_input_delay -clock clk_i  10  [get_ports {w_en[1]}]
set_input_delay -clock clk_i  10  [get_ports {w_en[0]}]
set_input_delay -clock clk_i  10  [get_ports {weight0[13]}]
set_input_delay -clock clk_i  10  [get_ports {weight0[12]}]
set_input_delay -clock clk_i  10  [get_ports {weight0[11]}]
set_input_delay -clock clk_i  10  [get_ports {weight0[10]}]
set_input_delay -clock clk_i  10  [get_ports {weight0[9]}]
set_input_delay -clock clk_i  10  [get_ports {weight0[8]}]
set_input_delay -clock clk_i  10  [get_ports {weight0[7]}]
set_input_delay -clock clk_i  10  [get_ports {weight0[6]}]
set_input_delay -clock clk_i  10  [get_ports {weight0[5]}]
set_input_delay -clock clk_i  10  [get_ports {weight0[4]}]
set_input_delay -clock clk_i  10  [get_ports {weight0[3]}]
set_input_delay -clock clk_i  10  [get_ports {weight0[2]}]
set_input_delay -clock clk_i  10  [get_ports {weight0[1]}]
set_input_delay -clock clk_i  10  [get_ports {weight0[0]}]
set_input_delay -clock clk_i  10  [get_ports {weight1[13]}]
set_input_delay -clock clk_i  10  [get_ports {weight1[12]}]
set_input_delay -clock clk_i  10  [get_ports {weight1[11]}]
set_input_delay -clock clk_i  10  [get_ports {weight1[10]}]
set_input_delay -clock clk_i  10  [get_ports {weight1[9]}]
set_input_delay -clock clk_i  10  [get_ports {weight1[8]}]
set_input_delay -clock clk_i  10  [get_ports {weight1[7]}]
set_input_delay -clock clk_i  10  [get_ports {weight1[6]}]
set_input_delay -clock clk_i  10  [get_ports {weight1[5]}]
set_input_delay -clock clk_i  10  [get_ports {weight1[4]}]
set_input_delay -clock clk_i  10  [get_ports {weight1[3]}]
set_input_delay -clock clk_i  10  [get_ports {weight1[2]}]
set_input_delay -clock clk_i  10  [get_ports {weight1[1]}]
set_input_delay -clock clk_i  10  [get_ports {weight1[0]}]
set_input_delay -clock clk_i  10  [get_ports {weight2[13]}]
set_input_delay -clock clk_i  10  [get_ports {weight2[12]}]
set_input_delay -clock clk_i  10  [get_ports {weight2[11]}]
set_input_delay -clock clk_i  10  [get_ports {weight2[10]}]
set_input_delay -clock clk_i  10  [get_ports {weight2[9]}]
set_input_delay -clock clk_i  10  [get_ports {weight2[8]}]
set_input_delay -clock clk_i  10  [get_ports {weight2[7]}]
set_input_delay -clock clk_i  10  [get_ports {weight2[6]}]
set_input_delay -clock clk_i  10  [get_ports {weight2[5]}]
set_input_delay -clock clk_i  10  [get_ports {weight2[4]}]
set_input_delay -clock clk_i  10  [get_ports {weight2[3]}]
set_input_delay -clock clk_i  10  [get_ports {weight2[2]}]
set_input_delay -clock clk_i  10  [get_ports {weight2[1]}]
set_input_delay -clock clk_i  10  [get_ports {weight2[0]}]
set_input_delay -clock clk_i  10  [get_ports {weight3[13]}]
set_input_delay -clock clk_i  10  [get_ports {weight3[12]}]
set_input_delay -clock clk_i  10  [get_ports {weight3[11]}]
set_input_delay -clock clk_i  10  [get_ports {weight3[10]}]
set_input_delay -clock clk_i  10  [get_ports {weight3[9]}]
set_input_delay -clock clk_i  10  [get_ports {weight3[8]}]
set_input_delay -clock clk_i  10  [get_ports {weight3[7]}]
set_input_delay -clock clk_i  10  [get_ports {weight3[6]}]
set_input_delay -clock clk_i  10  [get_ports {weight3[5]}]
set_input_delay -clock clk_i  10  [get_ports {weight3[4]}]
set_input_delay -clock clk_i  10  [get_ports {weight3[3]}]
set_input_delay -clock clk_i  10  [get_ports {weight3[2]}]
set_input_delay -clock clk_i  10  [get_ports {weight3[1]}]
set_input_delay -clock clk_i  10  [get_ports {weight3[0]}]
set_input_delay -clock clk_i  10  [get_ports {weight4[13]}]
set_input_delay -clock clk_i  10  [get_ports {weight4[12]}]
set_input_delay -clock clk_i  10  [get_ports {weight4[11]}]
set_input_delay -clock clk_i  10  [get_ports {weight4[10]}]
set_input_delay -clock clk_i  10  [get_ports {weight4[9]}]
set_input_delay -clock clk_i  10  [get_ports {weight4[8]}]
set_input_delay -clock clk_i  10  [get_ports {weight4[7]}]
set_input_delay -clock clk_i  10  [get_ports {weight4[6]}]
set_input_delay -clock clk_i  10  [get_ports {weight4[5]}]
set_input_delay -clock clk_i  10  [get_ports {weight4[4]}]
set_input_delay -clock clk_i  10  [get_ports {weight4[3]}]
set_input_delay -clock clk_i  10  [get_ports {weight4[2]}]
set_input_delay -clock clk_i  10  [get_ports {weight4[1]}]
set_input_delay -clock clk_i  10  [get_ports {weight4[0]}]
set_input_delay -clock clk_i  10  [get_ports {weight5[13]}]
set_input_delay -clock clk_i  10  [get_ports {weight5[12]}]
set_input_delay -clock clk_i  10  [get_ports {weight5[11]}]
set_input_delay -clock clk_i  10  [get_ports {weight5[10]}]
set_input_delay -clock clk_i  10  [get_ports {weight5[9]}]
set_input_delay -clock clk_i  10  [get_ports {weight5[8]}]
set_input_delay -clock clk_i  10  [get_ports {weight5[7]}]
set_input_delay -clock clk_i  10  [get_ports {weight5[6]}]
set_input_delay -clock clk_i  10  [get_ports {weight5[5]}]
set_input_delay -clock clk_i  10  [get_ports {weight5[4]}]
set_input_delay -clock clk_i  10  [get_ports {weight5[3]}]
set_input_delay -clock clk_i  10  [get_ports {weight5[2]}]
set_input_delay -clock clk_i  10  [get_ports {weight5[1]}]
set_input_delay -clock clk_i  10  [get_ports {weight5[0]}]
set_input_delay -clock clk_i  10  [get_ports {weight6[13]}]
set_input_delay -clock clk_i  10  [get_ports {weight6[12]}]
set_input_delay -clock clk_i  10  [get_ports {weight6[11]}]
set_input_delay -clock clk_i  10  [get_ports {weight6[10]}]
set_input_delay -clock clk_i  10  [get_ports {weight6[9]}]
set_input_delay -clock clk_i  10  [get_ports {weight6[8]}]
set_input_delay -clock clk_i  10  [get_ports {weight6[7]}]
set_input_delay -clock clk_i  10  [get_ports {weight6[6]}]
set_input_delay -clock clk_i  10  [get_ports {weight6[5]}]
set_input_delay -clock clk_i  10  [get_ports {weight6[4]}]
set_input_delay -clock clk_i  10  [get_ports {weight6[3]}]
set_input_delay -clock clk_i  10  [get_ports {weight6[2]}]
set_input_delay -clock clk_i  10  [get_ports {weight6[1]}]
set_input_delay -clock clk_i  10  [get_ports {weight6[0]}]
set_input_delay -clock clk_i  10  [get_ports {weight7[13]}]
set_input_delay -clock clk_i  10  [get_ports {weight7[12]}]
set_input_delay -clock clk_i  10  [get_ports {weight7[11]}]
set_input_delay -clock clk_i  10  [get_ports {weight7[10]}]
set_input_delay -clock clk_i  10  [get_ports {weight7[9]}]
set_input_delay -clock clk_i  10  [get_ports {weight7[8]}]
set_input_delay -clock clk_i  10  [get_ports {weight7[7]}]
set_input_delay -clock clk_i  10  [get_ports {weight7[6]}]
set_input_delay -clock clk_i  10  [get_ports {weight7[5]}]
set_input_delay -clock clk_i  10  [get_ports {weight7[4]}]
set_input_delay -clock clk_i  10  [get_ports {weight7[3]}]
set_input_delay -clock clk_i  10  [get_ports {weight7[2]}]
set_input_delay -clock clk_i  10  [get_ports {weight7[1]}]
set_input_delay -clock clk_i  10  [get_ports {weight7[0]}]
set_input_delay -clock clk_i  10  [get_ports {weight8[13]}]
set_input_delay -clock clk_i  10  [get_ports {weight8[12]}]
set_input_delay -clock clk_i  10  [get_ports {weight8[11]}]
set_input_delay -clock clk_i  10  [get_ports {weight8[10]}]
set_input_delay -clock clk_i  10  [get_ports {weight8[9]}]
set_input_delay -clock clk_i  10  [get_ports {weight8[8]}]
set_input_delay -clock clk_i  10  [get_ports {weight8[7]}]
set_input_delay -clock clk_i  10  [get_ports {weight8[6]}]
set_input_delay -clock clk_i  10  [get_ports {weight8[5]}]
set_input_delay -clock clk_i  10  [get_ports {weight8[4]}]
set_input_delay -clock clk_i  10  [get_ports {weight8[3]}]
set_input_delay -clock clk_i  10  [get_ports {weight8[2]}]
set_input_delay -clock clk_i  10  [get_ports {weight8[1]}]
set_input_delay -clock clk_i  10  [get_ports {weight8[0]}]
set_input_delay -clock clk_i  10  [get_ports {weight9[13]}]
set_input_delay -clock clk_i  10  [get_ports {weight9[12]}]
set_input_delay -clock clk_i  10  [get_ports {weight9[11]}]
set_input_delay -clock clk_i  10  [get_ports {weight9[10]}]
set_input_delay -clock clk_i  10  [get_ports {weight9[9]}]
set_input_delay -clock clk_i  10  [get_ports {weight9[8]}]
set_input_delay -clock clk_i  10  [get_ports {weight9[7]}]
set_input_delay -clock clk_i  10  [get_ports {weight9[6]}]
set_input_delay -clock clk_i  10  [get_ports {weight9[5]}]
set_input_delay -clock clk_i  10  [get_ports {weight9[4]}]
set_input_delay -clock clk_i  10  [get_ports {weight9[3]}]
set_input_delay -clock clk_i  10  [get_ports {weight9[2]}]
set_input_delay -clock clk_i  10  [get_ports {weight9[1]}]
set_input_delay -clock clk_i  10  [get_ports {weight9[0]}]
set_input_delay -clock clk_i  10  [get_ports {weight10[13]}]
set_input_delay -clock clk_i  10  [get_ports {weight10[12]}]
set_input_delay -clock clk_i  10  [get_ports {weight10[11]}]
set_input_delay -clock clk_i  10  [get_ports {weight10[10]}]
set_input_delay -clock clk_i  10  [get_ports {weight10[9]}]
set_input_delay -clock clk_i  10  [get_ports {weight10[8]}]
set_input_delay -clock clk_i  10  [get_ports {weight10[7]}]
set_input_delay -clock clk_i  10  [get_ports {weight10[6]}]
set_input_delay -clock clk_i  10  [get_ports {weight10[5]}]
set_input_delay -clock clk_i  10  [get_ports {weight10[4]}]
set_input_delay -clock clk_i  10  [get_ports {weight10[3]}]
set_input_delay -clock clk_i  10  [get_ports {weight10[2]}]
set_input_delay -clock clk_i  10  [get_ports {weight10[1]}]
set_input_delay -clock clk_i  10  [get_ports {weight10[0]}]
set_input_delay -clock clk_i  10  [get_ports {weight11[13]}]
set_input_delay -clock clk_i  10  [get_ports {weight11[12]}]
set_input_delay -clock clk_i  10  [get_ports {weight11[11]}]
set_input_delay -clock clk_i  10  [get_ports {weight11[10]}]
set_input_delay -clock clk_i  10  [get_ports {weight11[9]}]
set_input_delay -clock clk_i  10  [get_ports {weight11[8]}]
set_input_delay -clock clk_i  10  [get_ports {weight11[7]}]
set_input_delay -clock clk_i  10  [get_ports {weight11[6]}]
set_input_delay -clock clk_i  10  [get_ports {weight11[5]}]
set_input_delay -clock clk_i  10  [get_ports {weight11[4]}]
set_input_delay -clock clk_i  10  [get_ports {weight11[3]}]
set_input_delay -clock clk_i  10  [get_ports {weight11[2]}]
set_input_delay -clock clk_i  10  [get_ports {weight11[1]}]
set_input_delay -clock clk_i  10  [get_ports {weight11[0]}]
set_input_delay -clock clk_i  10  [get_ports {weight12[13]}]
set_input_delay -clock clk_i  10  [get_ports {weight12[12]}]
set_input_delay -clock clk_i  10  [get_ports {weight12[11]}]
set_input_delay -clock clk_i  10  [get_ports {weight12[10]}]
set_input_delay -clock clk_i  10  [get_ports {weight12[9]}]
set_input_delay -clock clk_i  10  [get_ports {weight12[8]}]
set_input_delay -clock clk_i  10  [get_ports {weight12[7]}]
set_input_delay -clock clk_i  10  [get_ports {weight12[6]}]
set_input_delay -clock clk_i  10  [get_ports {weight12[5]}]
set_input_delay -clock clk_i  10  [get_ports {weight12[4]}]
set_input_delay -clock clk_i  10  [get_ports {weight12[3]}]
set_input_delay -clock clk_i  10  [get_ports {weight12[2]}]
set_input_delay -clock clk_i  10  [get_ports {weight12[1]}]
set_input_delay -clock clk_i  10  [get_ports {weight12[0]}]
set_input_delay -clock clk_i  10  [get_ports {weight13[13]}]
set_input_delay -clock clk_i  10  [get_ports {weight13[12]}]
set_input_delay -clock clk_i  10  [get_ports {weight13[11]}]
set_input_delay -clock clk_i  10  [get_ports {weight13[10]}]
set_input_delay -clock clk_i  10  [get_ports {weight13[9]}]
set_input_delay -clock clk_i  10  [get_ports {weight13[8]}]
set_input_delay -clock clk_i  10  [get_ports {weight13[7]}]
set_input_delay -clock clk_i  10  [get_ports {weight13[6]}]
set_input_delay -clock clk_i  10  [get_ports {weight13[5]}]
set_input_delay -clock clk_i  10  [get_ports {weight13[4]}]
set_input_delay -clock clk_i  10  [get_ports {weight13[3]}]
set_input_delay -clock clk_i  10  [get_ports {weight13[2]}]
set_input_delay -clock clk_i  10  [get_ports {weight13[1]}]
set_input_delay -clock clk_i  10  [get_ports {weight13[0]}]
set_input_delay -clock clk_i  10  [get_ports {weight14[13]}]
set_input_delay -clock clk_i  10  [get_ports {weight14[12]}]
set_input_delay -clock clk_i  10  [get_ports {weight14[11]}]
set_input_delay -clock clk_i  10  [get_ports {weight14[10]}]
set_input_delay -clock clk_i  10  [get_ports {weight14[9]}]
set_input_delay -clock clk_i  10  [get_ports {weight14[8]}]
set_input_delay -clock clk_i  10  [get_ports {weight14[7]}]
set_input_delay -clock clk_i  10  [get_ports {weight14[6]}]
set_input_delay -clock clk_i  10  [get_ports {weight14[5]}]
set_input_delay -clock clk_i  10  [get_ports {weight14[4]}]
set_input_delay -clock clk_i  10  [get_ports {weight14[3]}]
set_input_delay -clock clk_i  10  [get_ports {weight14[2]}]
set_input_delay -clock clk_i  10  [get_ports {weight14[1]}]
set_input_delay -clock clk_i  10  [get_ports {weight14[0]}]
set_input_delay -clock clk_i  10  [get_ports {weight15[13]}]
set_input_delay -clock clk_i  10  [get_ports {weight15[12]}]
set_input_delay -clock clk_i  10  [get_ports {weight15[11]}]
set_input_delay -clock clk_i  10  [get_ports {weight15[10]}]
set_input_delay -clock clk_i  10  [get_ports {weight15[9]}]
set_input_delay -clock clk_i  10  [get_ports {weight15[8]}]
set_input_delay -clock clk_i  10  [get_ports {weight15[7]}]
set_input_delay -clock clk_i  10  [get_ports {weight15[6]}]
set_input_delay -clock clk_i  10  [get_ports {weight15[5]}]
set_input_delay -clock clk_i  10  [get_ports {weight15[4]}]
set_input_delay -clock clk_i  10  [get_ports {weight15[3]}]
set_input_delay -clock clk_i  10  [get_ports {weight15[2]}]
set_input_delay -clock clk_i  10  [get_ports {weight15[1]}]
set_input_delay -clock clk_i  10  [get_ports {weight15[0]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap0[13]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap0[12]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap0[11]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap0[10]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap0[9]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap0[8]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap0[7]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap0[6]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap0[5]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap0[4]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap0[3]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap0[2]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap0[1]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap0[0]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap1[13]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap1[12]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap1[11]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap1[10]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap1[9]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap1[8]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap1[7]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap1[6]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap1[5]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap1[4]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap1[3]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap1[2]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap1[1]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap1[0]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap2[13]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap2[12]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap2[11]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap2[10]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap2[9]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap2[8]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap2[7]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap2[6]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap2[5]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap2[4]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap2[3]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap2[2]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap2[1]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap2[0]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap3[13]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap3[12]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap3[11]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap3[10]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap3[9]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap3[8]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap3[7]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap3[6]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap3[5]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap3[4]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap3[3]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap3[2]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap3[1]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap3[0]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap4[13]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap4[12]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap4[11]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap4[10]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap4[9]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap4[8]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap4[7]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap4[6]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap4[5]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap4[4]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap4[3]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap4[2]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap4[1]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap4[0]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap5[13]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap5[12]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap5[11]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap5[10]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap5[9]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap5[8]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap5[7]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap5[6]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap5[5]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap5[4]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap5[3]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap5[2]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap5[1]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap5[0]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap6[13]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap6[12]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap6[11]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap6[10]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap6[9]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap6[8]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap6[7]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap6[6]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap6[5]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap6[4]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap6[3]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap6[2]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap6[1]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap6[0]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap7[13]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap7[12]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap7[11]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap7[10]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap7[9]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap7[8]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap7[7]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap7[6]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap7[5]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap7[4]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap7[3]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap7[2]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap7[1]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap7[0]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap8[13]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap8[12]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap8[11]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap8[10]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap8[9]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap8[8]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap8[7]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap8[6]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap8[5]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap8[4]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap8[3]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap8[2]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap8[1]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap8[0]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap9[13]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap9[12]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap9[11]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap9[10]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap9[9]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap9[8]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap9[7]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap9[6]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap9[5]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap9[4]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap9[3]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap9[2]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap9[1]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap9[0]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap10[13]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap10[12]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap10[11]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap10[10]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap10[9]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap10[8]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap10[7]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap10[6]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap10[5]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap10[4]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap10[3]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap10[2]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap10[1]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap10[0]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap11[13]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap11[12]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap11[11]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap11[10]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap11[9]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap11[8]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap11[7]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap11[6]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap11[5]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap11[4]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap11[3]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap11[2]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap11[1]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap11[0]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap12[13]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap12[12]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap12[11]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap12[10]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap12[9]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap12[8]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap12[7]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap12[6]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap12[5]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap12[4]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap12[3]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap12[2]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap12[1]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap12[0]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap13[13]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap13[12]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap13[11]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap13[10]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap13[9]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap13[8]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap13[7]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap13[6]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap13[5]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap13[4]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap13[3]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap13[2]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap13[1]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap13[0]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap14[13]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap14[12]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap14[11]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap14[10]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap14[9]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap14[8]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap14[7]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap14[6]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap14[5]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap14[4]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap14[3]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap14[2]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap14[1]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap14[0]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap15[13]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap15[12]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap15[11]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap15[10]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap15[9]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap15[8]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap15[7]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap15[6]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap15[5]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap15[4]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap15[3]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap15[2]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap15[1]}]
set_input_delay -clock clk_i  10  [get_ports {ifmap15[0]}]
set_input_delay -clock clk_i  10  [get_ports {add_i1[13]}]
set_input_delay -clock clk_i  10  [get_ports {add_i1[12]}]
set_input_delay -clock clk_i  10  [get_ports {add_i1[11]}]
set_input_delay -clock clk_i  10  [get_ports {add_i1[10]}]
set_input_delay -clock clk_i  10  [get_ports {add_i1[9]}]
set_input_delay -clock clk_i  10  [get_ports {add_i1[8]}]
set_input_delay -clock clk_i  10  [get_ports {add_i1[7]}]
set_input_delay -clock clk_i  10  [get_ports {add_i1[6]}]
set_input_delay -clock clk_i  10  [get_ports {add_i1[5]}]
set_input_delay -clock clk_i  10  [get_ports {add_i1[4]}]
set_input_delay -clock clk_i  10  [get_ports {add_i1[3]}]
set_input_delay -clock clk_i  10  [get_ports {add_i1[2]}]
set_input_delay -clock clk_i  10  [get_ports {add_i1[1]}]
set_input_delay -clock clk_i  10  [get_ports {add_i1[0]}]
set_input_delay -clock clk_i  10  [get_ports {add_i2[13]}]
set_input_delay -clock clk_i  10  [get_ports {add_i2[12]}]
set_input_delay -clock clk_i  10  [get_ports {add_i2[11]}]
set_input_delay -clock clk_i  10  [get_ports {add_i2[10]}]
set_input_delay -clock clk_i  10  [get_ports {add_i2[9]}]
set_input_delay -clock clk_i  10  [get_ports {add_i2[8]}]
set_input_delay -clock clk_i  10  [get_ports {add_i2[7]}]
set_input_delay -clock clk_i  10  [get_ports {add_i2[6]}]
set_input_delay -clock clk_i  10  [get_ports {add_i2[5]}]
set_input_delay -clock clk_i  10  [get_ports {add_i2[4]}]
set_input_delay -clock clk_i  10  [get_ports {add_i2[3]}]
set_input_delay -clock clk_i  10  [get_ports {add_i2[2]}]
set_input_delay -clock clk_i  10  [get_ports {add_i2[1]}]
set_input_delay -clock clk_i  10  [get_ports {add_i2[0]}]
set_input_delay -clock clk_i  10  [get_ports {add_i3[13]}]
set_input_delay -clock clk_i  10  [get_ports {add_i3[12]}]
set_input_delay -clock clk_i  10  [get_ports {add_i3[11]}]
set_input_delay -clock clk_i  10  [get_ports {add_i3[10]}]
set_input_delay -clock clk_i  10  [get_ports {add_i3[9]}]
set_input_delay -clock clk_i  10  [get_ports {add_i3[8]}]
set_input_delay -clock clk_i  10  [get_ports {add_i3[7]}]
set_input_delay -clock clk_i  10  [get_ports {add_i3[6]}]
set_input_delay -clock clk_i  10  [get_ports {add_i3[5]}]
set_input_delay -clock clk_i  10  [get_ports {add_i3[4]}]
set_input_delay -clock clk_i  10  [get_ports {add_i3[3]}]
set_input_delay -clock clk_i  10  [get_ports {add_i3[2]}]
set_input_delay -clock clk_i  10  [get_ports {add_i3[1]}]
set_input_delay -clock clk_i  10  [get_ports {add_i3[0]}]
set_input_delay -clock clk_i  10  [get_ports {add_i4[13]}]
set_input_delay -clock clk_i  10  [get_ports {add_i4[12]}]
set_input_delay -clock clk_i  10  [get_ports {add_i4[11]}]
set_input_delay -clock clk_i  10  [get_ports {add_i4[10]}]
set_input_delay -clock clk_i  10  [get_ports {add_i4[9]}]
set_input_delay -clock clk_i  10  [get_ports {add_i4[8]}]
set_input_delay -clock clk_i  10  [get_ports {add_i4[7]}]
set_input_delay -clock clk_i  10  [get_ports {add_i4[6]}]
set_input_delay -clock clk_i  10  [get_ports {add_i4[5]}]
set_input_delay -clock clk_i  10  [get_ports {add_i4[4]}]
set_input_delay -clock clk_i  10  [get_ports {add_i4[3]}]
set_input_delay -clock clk_i  10  [get_ports {add_i4[2]}]
set_input_delay -clock clk_i  10  [get_ports {add_i4[1]}]
set_input_delay -clock clk_i  10  [get_ports {add_i4[0]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_0[13]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_0[12]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_0[11]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_0[10]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_0[9]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_0[8]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_0[7]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_0[6]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_0[5]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_0[4]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_0[3]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_0[2]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_0[1]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_0[0]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_1[13]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_1[12]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_1[11]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_1[10]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_1[9]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_1[8]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_1[7]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_1[6]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_1[5]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_1[4]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_1[3]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_1[2]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_1[1]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_1[0]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_2[13]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_2[12]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_2[11]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_2[10]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_2[9]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_2[8]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_2[7]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_2[6]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_2[5]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_2[4]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_2[3]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_2[2]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_2[1]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_2[0]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_3[13]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_3[12]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_3[11]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_3[10]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_3[9]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_3[8]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_3[7]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_3[6]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_3[5]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_3[4]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_3[3]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_3[2]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_3[1]}]
set_output_delay -clock clk_i  10  [get_ports {ofmap_o_3[0]}]
set_output_delay -clock clk_i  10  [get_ports valid_o]
set_output_delay -clock clk_i  10  [get_ports {weight_index_o[11]}]
set_output_delay -clock clk_i  10  [get_ports {weight_index_o[10]}]
set_output_delay -clock clk_i  10  [get_ports {weight_index_o[9]}]
set_output_delay -clock clk_i  10  [get_ports {weight_index_o[8]}]
set_output_delay -clock clk_i  10  [get_ports {weight_index_o[7]}]
set_output_delay -clock clk_i  10  [get_ports {weight_index_o[6]}]
set_output_delay -clock clk_i  10  [get_ports {weight_index_o[5]}]
set_output_delay -clock clk_i  10  [get_ports {weight_index_o[4]}]
set_output_delay -clock clk_i  10  [get_ports {weight_index_o[3]}]
set_output_delay -clock clk_i  10  [get_ports {weight_index_o[2]}]
set_output_delay -clock clk_i  10  [get_ports {weight_index_o[1]}]
set_output_delay -clock clk_i  10  [get_ports {weight_index_o[0]}]
set_output_delay -clock clk_i  10  [get_ports {ifmap_index_o[14]}]
set_output_delay -clock clk_i  10  [get_ports {ifmap_index_o[13]}]
set_output_delay -clock clk_i  10  [get_ports {ifmap_index_o[12]}]
set_output_delay -clock clk_i  10  [get_ports {ifmap_index_o[11]}]
set_output_delay -clock clk_i  10  [get_ports {ifmap_index_o[10]}]
set_output_delay -clock clk_i  10  [get_ports {ifmap_index_o[9]}]
set_output_delay -clock clk_i  10  [get_ports {ifmap_index_o[8]}]
set_output_delay -clock clk_i  10  [get_ports {ifmap_index_o[7]}]
set_output_delay -clock clk_i  10  [get_ports {ifmap_index_o[6]}]
set_output_delay -clock clk_i  10  [get_ports {ifmap_index_o[5]}]
set_output_delay -clock clk_i  10  [get_ports {ifmap_index_o[4]}]
set_output_delay -clock clk_i  10  [get_ports {ifmap_index_o[3]}]
set_output_delay -clock clk_i  10  [get_ports {ifmap_index_o[2]}]
set_output_delay -clock clk_i  10  [get_ports {ifmap_index_o[1]}]
set_output_delay -clock clk_i  10  [get_ports {ifmap_index_o[0]}]
set_output_delay -clock clk_i  10  [get_ports {write_addr_o[12]}]
set_output_delay -clock clk_i  10  [get_ports {write_addr_o[11]}]
set_output_delay -clock clk_i  10  [get_ports {write_addr_o[10]}]
set_output_delay -clock clk_i  10  [get_ports {write_addr_o[9]}]
set_output_delay -clock clk_i  10  [get_ports {write_addr_o[8]}]
set_output_delay -clock clk_i  10  [get_ports {write_addr_o[7]}]
set_output_delay -clock clk_i  10  [get_ports {write_addr_o[6]}]
set_output_delay -clock clk_i  10  [get_ports {write_addr_o[5]}]
set_output_delay -clock clk_i  10  [get_ports {write_addr_o[4]}]
set_output_delay -clock clk_i  10  [get_ports {write_addr_o[3]}]
set_output_delay -clock clk_i  10  [get_ports {write_addr_o[2]}]
set_output_delay -clock clk_i  10  [get_ports {write_addr_o[1]}]
set_output_delay -clock clk_i  10  [get_ports {write_addr_o[0]}]
set_output_delay -clock clk_i  10  [get_ports {read_addr_o[12]}]
set_output_delay -clock clk_i  10  [get_ports {read_addr_o[11]}]
set_output_delay -clock clk_i  10  [get_ports {read_addr_o[10]}]
set_output_delay -clock clk_i  10  [get_ports {read_addr_o[9]}]
set_output_delay -clock clk_i  10  [get_ports {read_addr_o[8]}]
set_output_delay -clock clk_i  10  [get_ports {read_addr_o[7]}]
set_output_delay -clock clk_i  10  [get_ports {read_addr_o[6]}]
set_output_delay -clock clk_i  10  [get_ports {read_addr_o[5]}]
set_output_delay -clock clk_i  10  [get_ports {read_addr_o[4]}]
set_output_delay -clock clk_i  10  [get_ports {read_addr_o[3]}]
set_output_delay -clock clk_i  10  [get_ports {read_addr_o[2]}]
set_output_delay -clock clk_i  10  [get_ports {read_addr_o[1]}]
set_output_delay -clock clk_i  10  [get_ports {read_addr_o[0]}]
set_output_delay -clock clk_i  10  [get_ports done_o]
set_output_delay -clock clk_i  10  [get_ports {weight_ifmap_loop[5]}]
set_output_delay -clock clk_i  10  [get_ports {weight_ifmap_loop[4]}]
set_output_delay -clock clk_i  10  [get_ports {weight_ifmap_loop[3]}]
set_output_delay -clock clk_i  10  [get_ports {weight_ifmap_loop[2]}]
set_output_delay -clock clk_i  10  [get_ports {weight_ifmap_loop[1]}]
set_output_delay -clock clk_i  10  [get_ports {weight_ifmap_loop[0]}]
set_output_delay -clock clk_i  10  [get_ports {counter[10]}]
set_output_delay -clock clk_i  10  [get_ports {counter[9]}]
set_output_delay -clock clk_i  10  [get_ports {counter[8]}]
set_output_delay -clock clk_i  10  [get_ports {counter[7]}]
set_output_delay -clock clk_i  10  [get_ports {counter[6]}]
set_output_delay -clock clk_i  10  [get_ports {counter[5]}]
set_output_delay -clock clk_i  10  [get_ports {counter[4]}]
set_output_delay -clock clk_i  10  [get_ports {counter[3]}]
set_output_delay -clock clk_i  10  [get_ports {counter[2]}]
set_output_delay -clock clk_i  10  [get_ports {counter[1]}]
set_output_delay -clock clk_i  10  [get_ports {counter[0]}]
